fa15-hw4/app/controllers/dogs_controller.rb

  def show
    @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs"  WHERE "dogs"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @dog = Dog.create dog_params
---
INSERT INTO "dogs" ("age", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["age", 12], ["created_at", "2015-10-09 01:58:06.448520"], ["name", "Chris"], ["updated_at", "2015-10-09 01:58:06.448520"]]