fa15-hw3/app/controllers/pages_controller.rb

  def home
    @users = User.all
    @todos = Todo.all
    @cats = Cat.all
---
SELECT "users".* FROM "users"
SELECT "todos".* FROM "todos"
SELECT "cats".* FROM "cats"